In [2]:
import pandas as pd
# First dataframe
df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': [4, 5, 6]})
# Second dataframe
df2 = pd.DataFrame({'A': [7, 8, 9],
                    'B': [10, 11, 12]})
print(df1)
print(df2)

   A  B
0  1  4
1  2  5
2  3  6
   A   B
0  7  10
1  8  11
2  9  12

In [4]:
data = pd.concat([df1,df2])
data

   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12

In [8]:
data = pd.concat([df1,df2],ignore_index=True) #parameter ignore_index - digunakan untuk mengabaikan index yang ada
data

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

In [5]:
data = pd.concat([df1,df2],axis=1) #parmeter axis=1 - digunakan untuk menggabungkan dataframe secara horizontal
data

   A  B  A   B
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [14]:
data = pd.concat([df1,df2],axis=1,keys=['df1','df2']) #parameter keys - digunakan untuk memberikan nama pada dataframe
data

  df1    df2
    A  B   A   B
0   1  4   7  10
1   2  5   8  11
2   3  6   9  12

In [17]:
data.loc[:,'df1'] #mengambil kolom A dari dataframe df1

   A  B
0  1  4
1  2  5
2  3  6

In [20]:
cuaca_indonesia = pd.DataFrame({
    'city':['Jakarta','Bandung','Surabaya'],
    'temperature':[30,29,32]
}).set_index('city')
musim_indonesia = pd.DataFrame({
    'city':['Jakarta','Bandung','Surabaya'],
    'musim':['Hujan','Panas','Panas']
}).set_index('city')

data = pd.concat([cuaca_indonesia,musim_indonesia],axis=1)
data.reset_index(inplace=True)
data

       city  temperature  musim
0   Jakarta           30  Hujan
1   Bandung           29  Panas
2  Surabaya           32  Panas